# customer-api - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/customer/customer-api/infrastructure/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/staging-customer-api/runs/run-NHko7gcsoZBdvnFc

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.aws_lambda.data.archive_file.default: Refreshing...
module.database_user.cockroach_sql_user.default: Refreshing state... [id=4c45f571-12f3-419e-90a1-254b3e875ae0:staging-customer-api]
module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-customer-api-staging-20230426110646863900000001]
module.aws_lambda.aws_iam_role.default: Refreshing state... [id=lambda-execution-customer-api-staging]
module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/staging-customer-api]
module.aws_api_gateway.aws_apigatewayv2_route.any: Refreshing state... [id=vsi1ddg]
module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=vtt9lgi7qd]
module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/staging-customer-api]
module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=y30atqe]
module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=staging-customer-api]
module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Refreshing...
module.common_resources.module.aws_lambda.data.archive_file.default: Refresh complete after 2s [id=9f8185544c5882212e48a2b70c764b996761e096]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Refreshing...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Refresh complete after 0s [id=3693445097]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Refresh complete after 0s [id=staging-cockroachdb-serverless-cluster-id]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws_api_gateway.aws_apigatewayv2_api.default will be destroyed
  # (because aws_apigatewayv2_api.default is not in configuration)
  - resource "aws_apigatewayv2_api" "default" {
      - api_endpoint                 = "https://vtt9lgi7qd.execute-api.ap-southeast-1.amazonaws.com" -> null
      - api_key_selection_expression = "$request.header.x-api-key" -> null
      - arn                          = "arn:aws:apigateway:ap-southeast-1::/apis/vtt9lgi7qd" -> null
      - disable_execute_api_endpoint = false -> null
      - execution_arn                = "arn:aws:execute-api:ap-southeast-1:514472330244:vtt9lgi7qd" -> null
      - id                           = "vtt9lgi7qd" -> null
      - name                         = "staging-customer-api" -> null
      - protocol_type                = "HTTP" -> null
      - route_selection_expression   = "$request.method $request.path" -> null
      - tags                         = {
          - "domain"        = "customer"
          - "environment"   = "staging"
          - "resource"      = "customer-api"
          - "resource_type" = "api_gateway"
        } -> null
      - tags_all                     = {
          - "domain"        = "customer"
          - "environment"   = "staging"
          - "resource"      = "customer-api"
          - "resource_type" = "api_gateway"
        } -> null

      - cors_configuration {
          - allow_credentials = false -> null
          - allow_headers     = [] -> null
          - allow_methods     = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "POST",
            ] -> null
          - allow_origins     = [
              - "*",
            ] -> null
          - expose_headers    = [] -> null
          - max_age           = 0 -> null
        }
    }

  # module.aws_api_gateway.aws_apigatewayv2_integration.default will be destroyed
  # (because aws_apigatewayv2_integration.default is not in configuration)
  - resource "aws_apigatewayv2_integration" "default" {
      - api_id                 = "vtt9lgi7qd" -> null
      - connection_type        = "INTERNET" -> null
      - id                     = "y30atqe" -> null
      - integration_method     = "POST" -> null
      - integration_type       = "AWS_PROXY" -> null
      - integration_uri        = "arn:aws:apigateway:ap-southeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-1:514472330244:function:staging-customer-api/invocations" -> null
      - payload_format_version = "1.0" -> null
      - request_parameters     = {} -> null
      - request_templates      = {} -> null
      - timeout_milliseconds   = 30000 -> null
    }

  # module.aws_api_gateway.aws_apigatewayv2_route.any will be destroyed
  # (because aws_apigatewayv2_route.any is not in configuration)
  - resource "aws_apigatewayv2_route" "any" {
      - api_id               = "vtt9lgi7qd" -> null
      - api_key_required     = false -> null
      - authorization_scopes = [] -> null
      - authorization_type   = "NONE" -> null
      - id                   = "vsi1ddg" -> null
      - request_models       = {} -> null
      - route_key            = "$default" -> null
      - target               = "integrations/y30atqe" -> null
    }

  # module.aws_api_gateway.aws_apigatewayv2_stage.default will be destroyed
  # (because aws_apigatewayv2_stage.default is not in configuration)
  - resource "aws_apigatewayv2_stage" "default" {
      - api_id          = "vtt9lgi7qd" -> null
      - arn             = "arn:aws:apigateway:ap-southeast-1::/apis/vtt9lgi7qd/stages/$default" -> null
      - auto_deploy     = true -> null
      - deployment_id   = "jx6li4" -> null
      - execution_arn   = "arn:aws:execute-api:ap-southeast-1:514472330244:vtt9lgi7qd/$default" -> null
      - id              = "$default" -> null
      - invoke_url      = "https://vtt9lgi7qd.execute-api.ap-southeast-1.amazonaws.com/" -> null
      - name            = "$default" -> null
      - stage_variables = {} -> null
      - tags            = {
          - "domain"        = "customer"
          - "environment"   = "staging"
          - "resource"      = "customer-api"
          - "resource_type" = "api_gateway"
        } -> null
      - tags_all        = {
          - "domain"        = "customer"
          - "environment"   = "staging"
          - "resource"      = "customer-api"
          - "resource_type" = "api_gateway"
        } -> null

      - access_log_settings {
          - destination_arn = "arn:aws:logs:ap-southeast-1:514472330244:log-group:/aws/api_gateway/staging-customer-api" -> null
          - format          = jsonencode(
                {
                  - httpMethod              = "$context.httpMethod"
                  - integrationErrorMessage = "$context.integrationErrorMessage"
                  - protocol                = "$context.protocol"
                  - requestId               = "$context.requestId"
                  - requestTime             = "$context.requestTime"
                  - resourcePath            = "$context.resourcePath"
                  - responseLength          = "$context.responseLength"
                  - routeKey                = "$context.routeKey"
                  - sourceIp                = "$context.identity.sourceIp"
                  - status                  = "$context.status"
                }
            ) -> null
        }

      - default_route_settings {
          - data_trace_enabled       = false -> null
          - detailed_metrics_enabled = false -> null
          - throttling_burst_limit   = 0 -> null
          - throttling_rate_limit    = 0 -> null
        }
    }

  # module.aws_api_gateway.aws_cloudwatch_log_group.default will be destroyed
  # (because aws_cloudwatch_log_group.default is not in configuration)
  - resource "aws_cloudwatch_log_group" "default" {
      - arn               = "arn:aws:logs:ap-southeast-1:514472330244:log-group:/aws/api_gateway/staging-customer-api" -> null
      - id                = "/aws/api_gateway/staging-customer-api" -> null
      - name              = "/aws/api_gateway/staging-customer-api" -> null
      - retention_in_days = 7 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "domain"        = "customer"
          - "environment"   = "staging"
          - "resource"      = "customer-api"
          - "resource_type" = "api_gateway"
        } -> null
      - tags_all          = {
          - "domain"        = "customer"
          - "environment"   = "staging"
          - "resource"      = "customer-api"
          - "resource_type" = "api_gateway"
        } -> null
    }

  # module.aws_api_gateway.aws_lambda_permission.default will be destroyed
  # (because aws_lambda_permission.default is not in configuration)
  - resource "aws_lambda_permission" "default" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "staging-customer-api" -> null
      - id            = "AllowExecutionFromAPIGateway" -> null
      - principal     = "apigateway.amazonaws.com" -> null
      - source_arn    = "arn:aws:execute-api:ap-southeast-1:514472330244:vtt9lgi7qd/*/*" -> null
      - statement_id  = "AllowExecutionFromAPIGateway" -> null
    }

  # module.aws_lambda.aws_cloudwatch_log_group.default will be destroyed
  # (because aws_cloudwatch_log_group.default is not in configuration)
  - resource "aws_cloudwatch_log_group" "default" {
      - arn               = "arn:aws:logs:ap-southeast-1:514472330244:log-group:/aws/lambda/staging-customer-api" -> null
      - id                = "/aws/lambda/staging-customer-api" -> null
      - name              = "/aws/lambda/staging-customer-api" -> null
      - retention_in_days = 7 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "domain"        = "customer"
          - "environment"   = "staging"
          - "resource"      = "customer-api"
          - "resource_type" = "lambda"
        } -> null
      - tags_all          = {
          - "domain"        = "customer"
          - "environment"   = "staging"
          - "resource"      = "customer-api"
          - "resource_type" = "lambda"
        } -> null
    }

  # module.aws_lambda.aws_iam_role.default will be destroyed
  # (because aws_iam_role.default is not in configuration)
  - resource "aws_iam_role" "default" {
      - arn                   = "arn:aws:iam::514472330244:role/lambda-execution-customer-api-staging" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-04-26T11:06:46Z" -> null
      - force_detach_policies = false -> null
      - id                    = "lambda-execution-customer-api-staging" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "lambda-execution-customer-api-staging" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = ""
              - region         = ""
            },
        ] -> null
      - tags                  = {
          - "domain"        = "customer"
          - "environment"   = "staging"
          - "resource"      = "customer-api"
          - "resource_type" = "lambda"
        } -> null
      - tags_all              = {
          - "domain"        = "customer"
          - "environment"   = "staging"
          - "resource"      = "customer-api"
          - "resource_type" = "lambda"
        } -> null
      - unique_id             = "AROAXPSHQYQCKKCBP2TMM" -> null
    }

  # module.aws_lambda.aws_iam_role_policy_attachment.default will be destroyed
  # (because aws_iam_role_policy_attachment.default is not in configuration)
  - resource "aws_iam_role_policy_attachment" "default" {
      - id         = "lambda-execution-customer-api-staging-20230426110646863900000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole" -> null
      - role       = "lambda-execution-customer-api-staging" -> null
    }

  # module.aws_lambda.aws_lambda_function.default will be destroyed
  # (because aws_lambda_function.default is not in configuration)
  - resource "aws_lambda_function" "default" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-1:514472330244:function:staging-customer-api" -> null
      - filename                       = "../../../../../shared/infrastructure/modules/lambda/lambda.zip" -> null
      - function_name                  = "staging-customer-api" -> null
      - handler                        = "main" -> null
      - id                             = "staging-customer-api" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-1:514472330244:function:staging-customer-api/invocations" -> null
      - last_modified                  = "2023-04-26T19:39:23.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-1:514472330244:function:staging-customer-api:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-1:514472330244:function:staging-customer-api:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::514472330244:role/lambda-execution-customer-api-staging" -> null
      - runtime                        = "go1.x" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "omLknDJ8LH5EYkimRcZ3IPcaFhIot0+5COltdIETBSE=" -> null
      - source_code_size               = 18749295 -> null
      - tags                           = {
          - "domain"        = "customer"
          - "environment"   = "staging"
          - "resource"      = "customer-api"
          - "resource_type" = "lambda"
        } -> null
      - tags_all                       = {
          - "domain"        = "customer"
          - "environment"   = "staging"
          - "resource"      = "customer-api"
          - "resource_type" = "lambda"
        } -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING" = (sensitive value)
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.database_user.cockroach_sql_user.default will be destroyed
  # (because cockroach_sql_user.default is not in configuration)
  - resource "cockroach_sql_user" "default" {
      - cluster_id = (sensitive value) -> null
      - id         = "4c45f571-12f3-419e-90a1-254b3e875ae0:staging-customer-api" -> null
      - name       = "staging-customer-api" -> null
      - password   = (sensitive value) -> null
    }

  # module.database_user.random_password.password will be destroyed
  # (because random_password.password is not in configuration)
  - resource "random_password" "password" {
      - bcrypt_hash      = (sensitive value) -> null
      - id               = "none" -> null
      - keepers          = {
          - "random_seed" = "57e279e9-3d4f-46ef-91b1-cc63b59602eb"
        } -> null
      - length           = 64 -> null
      - lower            = true -> null
      - min_lower        = 0 -> null
      - min_numeric      = 0 -> null
      - min_special      = 0 -> null
      - min_upper        = 0 -> null
      - number           = true -> null
      - numeric          = true -> null
      - override_special = "!#$%&*()-_=+[]{}<>:?" -> null
      - result           = (sensitive value) -> null
      - special          = true -> null
      - upper            = true -> null
    }

  # module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default will be created
  + resource "aws_apigatewayv2_api" "default" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "staging-customer-api"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags                         = {
          + "domain"        = "customer"
          + "environment"   = "staging"
          + "resource"      = "customer-api"
          + "resource_type" = "api_gateway"
        }
      + tags_all                     = {
          + "domain"        = "customer"
          + "environment"   = "staging"
          + "resource"      = "customer-api"
          + "resource_type" = "api_gateway"
        }

      + cors_configuration {
          + allow_credentials = false
          + allow_methods     = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "POST",
            ]
          + allow_origins     = [
              + "*",
            ]
          + max_age           = 0
        }
    }

  # module.common_resources.module.aws_api_gateway.aws_apigatewayv2_integration.default will be created
  + resource "aws_apigatewayv2_integration" "default" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.common_resources.module.aws_api_gateway.aws_apigatewayv2_route.any will be created
  + resource "aws_apigatewayv2_route" "any" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "$default"
      + target             = (known after apply)
    }

  # module.common_resources.module.aws_api_gateway.aws_apigatewayv2_stage.default will be created
  + resource "aws_apigatewayv2_stage" "default" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags          = {
          + "domain"        = "customer"
          + "environment"   = "staging"
          + "resource"      = "customer-api"
          + "resource_type" = "api_gateway"
        }
      + tags_all      = {
          + "domain"        = "customer"
          + "environment"   = "staging"
          + "resource"      = "customer-api"
          + "resource_type" = "api_gateway"
        }

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + httpMethod              = "$context.httpMethod"
                  + integrationErrorMessage = "$context.integrationErrorMessage"
                  + protocol                = "$context.protocol"
                  + requestId               = "$context.requestId"
                  + requestTime             = "$context.requestTime"
                  + resourcePath            = "$context.resourcePath"
                  + responseLength          = "$context.responseLength"
                  + routeKey                = "$context.routeKey"
                  + sourceIp                = "$context.identity.sourceIp"
                  + status                  = "$context.status"
                }
            )
        }
    }

  # module.common_resources.module.aws_api_gateway.aws_cloudwatch_log_group.default will be created
  + resource "aws_cloudwatch_log_group" "default" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/api_gateway/staging-customer-api"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "domain"        = "customer"
          + "environment"   = "staging"
          + "resource"      = "customer-api"
          + "resource_type" = "api_gateway"
        }
      + tags_all          = {
          + "domain"        = "customer"
          + "environment"   = "staging"
          + "resource"      = "customer-api"
          + "resource_type" = "api_gateway"
        }
    }

  # module.common_resources.module.aws_api_gateway.aws_lambda_permission.default will be created
  + resource "aws_lambda_permission" "default" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "staging-customer-api"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default will be created
  + resource "aws_cloudwatch_log_group" "default" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/staging-customer-api"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "domain"        = "customer"
          + "environment"   = "staging"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
      + tags_all          = {
          + "domain"        = "customer"
          + "environment"   = "staging"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
    }

  # module.common_resources.module.aws_lambda.aws_iam_role.default will be created
  + resource "aws_iam_role" "default" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-execution-customer-api-staging"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "domain"        = "customer"
          + "environment"   = "staging"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
      + tags_all              = {
          + "domain"        = "customer"
          + "environment"   = "staging"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
      + unique_id             = (known after apply)
    }

  # module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default will be created
  + resource "aws_iam_role_policy_attachment" "default" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "lambda-execution-customer-api-staging"
    }

  # module.common_resources.module.aws_lambda.aws_lambda_function.default will be created
  + resource "aws_lambda_function" "default" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "../../../../../shared/infrastructure/modules/lambda/lambda.zip"
      + function_name                  = "staging-customer-api"
      + handler                        = "main"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "go1.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "omLknDJ8LH5EYkimRcZ3IPcaFhIot0+5COltdIETBSE="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "domain"        = "customer"
          + "environment"   = "staging"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
      + tags_all                       = {
          + "domain"        = "customer"
          + "environment"   = "staging"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "staging-customer"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "staging-customer-api"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be created
  + resource "cockroach_sql_user" "default" {
      + cluster_id = (sensitive value)
      + id         = (known after apply)
      + name       = "staging-customer-api"
      + password   = (sensitive value)
    }

  # module.common_resources.module.database_user.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "random_seed" = "c791140b-6cb3-49ff-952e-7905a781cfc6"
        }
      + length           = 64
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 12 to add, 0 to change, 12 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*